//*-Task №81 Twice as old (8kyu)
/*
Ваша функція приймає два аргументи:

поточний вік батька (років)
поточний вік його сина (років)
Обчисліть, скільки років тому батько був удвічі старший за сина (чи через скільки років він буде удвічі старший).
Відповідь завжди більше або дорівнює 0, незалежно від того, було це в минулому чи в майбутньому.
*/

// Мій варіант
function twiceAsOld(dadYearsOld, sonYearsOld) {
    return dadYearsOld / (sonYearsOld * 2) === 2 ? 0 : Math.abs(dadYearsOld - (sonYearsOld * 2));
}

// Цікаві варіанти з Codewars
function twiceAsOld_(dadYearsOld, sonYearsOld) {
    return Math.abs(dadYearsOld - 2 * sonYearsOld);
}
// ================================================================================================
// ================================================================================================
//*-Task №82 Keep up the hoop (8kyu)
/*
Алекс щойно отримав новий хулахуп, він йому подобається, але відчуває розчарування, тому що його
молодший брат кращий за нього.
Напишіть програму, у якій Алекс може ввести (n), скільки разів обертається обруч, і вона поверне
йому підбадьорююче повідомлення :)
Якщо Алекс отримує 10 або більше кілець, поверніть рядок «Great, now move on to tricks».
Якщо він не отримує 10 обручів, поверніть рядок «Keep at it until you get it».
*/

// Мій варіант
function hoopCount(n) {
    return n < 10 ? "Keep at it until you get it" : "Great, now move on to tricks";
}

// Цікаві варіанти з Codewars

// ================================================================================================
// ================================================================================================
//*-Task №83 All Star Code Challenge #18 (8kyu)
/*
Створіть функцію, яка приймає рядок і один символ і повертає ціле число входжень другого аргументу,
знайденого в першому.
Якщо входження не знайдено, має бути повернуто кількість 0.
*/

// Мій варіант
function strCount(str, letter) {
    return str.split('').filter(word => word === letter).length;
}

// Цікаві варіанти з Codewars
function strCount_(str, letter) {
    return str.split(letter).length - 1
}
// ================================================================================================
// ================================================================================================
//*-Task №84 Volume of a Cuboid (8kyu)
/*
Бобу потрібен швидкий спосіб обчислити об’єм кубоїда за трьома значеннями: довжиною, шириною та
висотою кубоїда. Напишіть функцію, яка допоможе Бобу з цим обчисленням.
*/

// Мій варіант
class Kata {
    static getVolumeOfCuboid(length, width, height) {
        return length * width * height;
    }
}

// Цікаві варіанти з Codewars

// ================================================================================================
// ================================================================================================
//*-залишилось 298шт
