"use strict"
// ================================================================================================
//*-Task №61 Sum without highest and lowest number (8kyu)
/*
Підсумуйте всі числа даного масиву, крім найвищого та найнижчого елементів (за значенням, а не за індексом!).
Найвищий або найнижчий елемент, відповідно, є одним елементом на кожному краю, навіть якщо їх більше одного
з однаковим значенням.
Зверніть увагу на перевірку введених даних:
Приклад:
{ 6, 2, 1, 8, 10 } => 16
{ 1, 1, 11, 2, 3 } => 6
Перевірка введених даних:
Якщо замість масиву вказано порожнє значення (null, None, Nothing тощо), або даний масив є порожнім
списком або списком лише з 1 елементом, поверніть 0.
*/

// Мій варіант
function sumArray(array) {
    if (Array.isArray(array) && array.length > 1) {
        let sumArray = array.reduce((accum, elem) => { return accum + elem });
        let sumMaxAndMinElem = Math.max(...array) + Math.min(...array);
        return sumArray - sumMaxAndMinElem;
    } else {
        return 0;
    }
}
// Цікаві варіанти з Codewars
function sumArray_(array) {
    array = array || [];
    return array
        .sort((a, b) => a - b)
        .slice(1, -1)
        .reduce((a, b) => a + b, 0);
}
// ================================================================================================
// ================================================================================================
//*-Task №62 Area or Perimeter (8kyu)
/*
Вам задано довжину та ширину 4-стороннього багатокутника.
Багатокутник може бути як прямокутником, так і квадратом.
Якщо це квадрат, поверніть його площу. Якщо це прямокутник, поверніть його периметр.

Приклад (Input1, Input2 --> Output):
6, 10 --> 32
3, 3 --> 9
Примітка:
для йієї задачі ви припускаєте, що це квадрат, якщо його довжина та ширина рівні, інакше це прямокутник.
*/

// Мій варіант
const areaOrPerimeter = function (l, w) {
    return l === w ? l * w : (l * 2) + (w * 2);
};
// Цікаві варіанти з Codewars
const areaOrPerimeter_ = (l, w) => l === w ? l * w : 2 * (l + w);
// ================================================================================================
// ================================================================================================
//*-осталось 320шт
// console.time('timer_1');
// console.timeEnd('timer_1');

// console.time('timer_2');
// console.timeEnd('timer_2');