//*-Task №801 Find all occurrences of an element in an array (7kyu)
/*
Дано масив цілих чисел та ціле число n.
Знайдіть усі входження n у заданий масив та поверніть інший масив,
що містить усі індексні позиції n у заданому масиві.

Якщо n немає у заданому масиві, поверніть порожній масив [].

Вважайте, що n та всі значення у заданому масиві завжди будуть цілими числами.

Приклад:
findAll([6, 9, 3, 4, 3, 82, 11], 3) => [2, 4]
*/

// Мій варіант
function findAll(array, n) {
  const result = [];
  array.forEach((number, i) => {
    if (number === n) {
      result.push(i);
    }
  });
  return result;
}
// Цікаві варіанти від GPT
const findAll_ = (arr, n) =>
  arr.map((v, i) => (v === n ? i : -1)).filter((i) => i !== -1);
// ================================================================================================
// ================================================================================================
//*-Task №802 Regexp Basics - is it a letter? (7kyu)
/*
Доповніть код, який має повертати значення true, якщо заданий об'єкт є однією літерою ASCII
(нижньою чи верхньою), в іншому випадку — значення false.
String.prototype.isLetter = function() {
}
*/

// Мій варіант
String.prototype.isLetter = function () {
  return /^[a-zA-Z]$/.test(this);
};
// Цікаві варіанти від GPT

// ================================================================================================
// ================================================================================================
//*-Task №803 Find the calculation type (7kyu)
/*
Вам потрібно створити функцію, яка отримує 3 числові аргументи: 2 операнди a та b,
а також результат невідомої операції, виконаної над ними.

На основі цих 3 значень вам потрібно повернути рядок, який описує, яка операція була використана
для отримання заданого результату.

Можливі рядки повернення: "addition", "addition", "multiplication", "division".

Приклади:
(a = 1, b = 2, результат = 3) --> 1 ? 2 = 3 --> "addition"
(a = 5, b = 2, результат = 2.5) --> 5 ? 2 = 2.5 --> "division"
Примітки
Оператор / виконує просте ділення без округлення.
Можна припустити, що завжди буде єдина правильна відповідь (немає неоднозначних випадків, таких як,
наприклад, 1 ? 0 = 0, що може бути - або +, або 3 ? 1 = 3, що може бути * або /).
Можна припустити, що ділення на 0 не буде
*/

// Мій варіант
function calcType(a, b, res) {
  if (a + b === res) return 'addition';
  if (a - b === res) return 'subtraction';
  if (a * b === res) return 'multiplication';
  if (a / b === res) return 'division';
}
// Цікаві варіанти з Codewars
const calcType_ = (a, b, res) =>
  ({
    [a + b]: `addition`,
    [a - b]: `subtraction`,
    [a * b]: `multiplication`,
    [a / b]: `division`,
  }[res]);
//
function calcType__(a, b, res) {
  switch (res) {
    case a + b:
      return 'addition';
    case a - b:
      return 'subtraction';
    case a / b:
      return 'division';
    case a * b:
      return 'multiplication';
  }
}

// ================================================================================================
// ================================================================================================
//*-Task №804 Odder Than the Rest (7kyu)
/*
Створіть метод, який приймає масив як вхідні дані та виводить індекс, за яким знаходиться
єдине непарне число.

Цей метод має працювати з масивами з від'ємними числами. Якщо в масиві немає непарних чисел,
то метод має виводити -1.

Приклади:
oddOne([2,4,6,7,10]) // => 3
oddOne([2,16,98,10,13,78]) // => 4
oddOne([4,-8,98,-12,-7,90,100]) // => 4
oddOne([2,4,6,8]) // => -1
*/

// Мій варіант
function oddOne(arr) {
  return arr.indexOf(arr.find((n) => n % 2 !== 0));
}
// Цікаві варіанти з Codewars
function oddOne_(arr) {
  return arr.findIndex((x) => x % 2 !== 0);
}
// ================================================================================================
// ================================================================================================
// console.time('timer_1');
// console.timeEnd('timer_1');
//*-Task №805 Return a sorted list of objects (7kyu)
/*
Вам буде передано масив об'єктів (список) - ви повинні відсортувати їх у порядку спадання
на основі значення вказаної властивості (sortBy).

Приклад
Під час сортування за "a", це:

[
{"a": 1, "b": 3},
{"a": 3, "b": 2},
{"a": 2, "b": 40},
{"a": 4, "b": 12}
]
має повернути:

[
{"a": 4, "b": 12},
{"a": 3, "b": 2},
{"a": 2, "b": 40},
{"a": 1, "b": 3}
]
Значення завжди будуть числами, а властивості завжди існуватимуть.
*/

// Мій варіант
function sortList(sortBy, list) {
  return list.sort((a, b) => a[sortBy] - b[sortBy]);
}
// Цікаві варіанти з Codewars
function sortList_(sortBy, list) {
  return list.sort(function (a, b) {
    return a[sortBy] < b[sortBy];
  });
}
// ================================================================================================
// ================================================================================================
// console.time('timer_1');
// console.timeEnd('timer_1');
