"use strict"
// ================================================================================================
//**Task №1 Even or Odd (8kyu)
/*
Створіть функцію, яка приймає ціле число як аргумент і повертає «Even» для парних чисел
або «Odd» для непарних чисел.
*/

// Мій варіант
function evenOrOdd(number) {
    return number % 2 === 0 ? 'Even' : 'Odd';
}
// Цікаві варіанти з Codewars
const evenOrOdd_ = (number) => number % 2 ? "Odd" : 'Even';
// ================================================================================================
// ================================================================================================
//**Task №2 Return Negative (8kyu)
/*
У цьому простому завданні вам дано число, і ви повинні зробити його від’ємним. Але, може, число вже негативне?

Приклади:
makeNegative(1);    // return -1
makeNegative(-5);   // return -5
makeNegative(0);    // return 0
makeNegative(0.12); // return -0.12

Примітки:
Число вже може бути від’ємним, і в цьому випадку зміна не потрібна.
Нуль (0) не перевіряється на будь-який конкретний знак. Від’ємні нулі не мають математичного сенсу.
*/

// Мій варіант
function makeNegative(num) {
    return num > 0 ? num * -1 : num;
}

// Цікаві варіанти з Codewars
function makeNegative_(num) {
    return -Math.abs(num); // Такий варіант повертає -0. Дивне рішення.
}
/*
Метод Math.abs() возвращает абсолютное значение числа.
Math.abs("-1"); // 1
Math.abs(-2); // 2
Math.abs(null); // 0
Math.abs(""); // 0
Math.abs([]); // 0
Math.abs([2]); // 2
Math.abs([1, 2]); // NaN
Math.abs({}); // NaN
Math.abs("string"); // NaN
Math.abs(); // NaN
*/

//
function makeNegative__(num) {
    return num < 0 ? num : -num; // Такий варіант повертає -0 :)
}
console.log(makeNegative__(0));
console.log(makeNegative_(0));
// ================================================================================================
// ================================================================================================
//**Task №3 Sum of positive (8kyu)
/*
Ви отримуєте масив чисел, повертаєте суму всіх додатніх.
Приклад: [1,-4,7,12] => 1 + 7 + 12 = 20
Примітка: якщо немає нічого для додавання, сума за замовченням дорівнює 0.
*/

// Мій варіант
function positiveSum(arr) {
    let sum = arr.reduce(function (accumulator, element) {
        if (element > 0) {
            return accumulator + element;
        }
        return accumulator;
    }, 0);
    return sum;
}

// Цікаві варіанти з Codewars
function positiveSum_(arr) {
    return arr.reduce((a, b) => a + (b > 0 ? b : 0), 0);
}
//
function positiveSum__(arr) {
    var total = 0;
    for (i = 0; i < arr.length; i++) {
        if (arr[i] > 0) {
            total += arr[i];
        }
    }
    return total;
}
// ================================================================================================
// ================================================================================================
//**Task №4 Convert boolean values to strings 'Yes' or 'No'. (8kyu)
/*
Завершіть метод, який приймає логічне значення та повертає рядок «Так» для істини
або рядок «Ні» для хибності.
*/

// Мій варіант
function boolToWord(bool) {
    return bool ? 'Yes' : 'No';
}

// Цікаві варіанти з Codewars
let boolToWord_ = bool => bool ? 'Yes' : 'No';
// ================================================================================================
// ================================================================================================
//**Task №5 Convert a Number to a String! (8kyu)
/*
Нам потрібна функція, яка може перетворити число (ціле) у рядок.
Які шляхи досягнення цього ви знаєте?
Приклади (введення --> вихід):
123 --> "123"
999 --> "999"
-100 --> "-100"
*/

// Мій варіант
function numberToString(num) {
    return String(num);
}

// Цікаві варіанти з Codewars
function numberToString_(num) {
    return num.toString();
}
//
const numberToString__ = num => `${num}`;
//
function numberToString___(num) {
    return num + '';
}
// ================================================================================================
// ================================================================================================
//**Task №6 Opposite number (8kyu)
/*
Дуже просто, якщо дано ціле число або число з плаваючою комою, знайти його протилежність.
Приклади:
1: -1
14: -14
-34: 34
*/

// Мій варіант
function opposite(number) {
    return number * -1;
}

// Цікаві варіанти з Codewars
function opposite_(number) { // Такий варіант повертає -0 :)
    return (-number);
}
// ================================================================================================
// ================================================================================================
//**Task №7 Square(n) Sum (8kyu)
/*
Завершіть функцію суми квадратів, щоб вона звела в квадрат кожне передане їй число, а потім підсумувала результати.
Наприклад, для [1, 2, 2] він має повернути 9
*/

// Мій варіант
function squareSum(numbers) {
    let squareSum = numbers.reduce(function (accumulator, element) {
        return accumulator + (element * element);
    }, 0);
    return squareSum;
}

// Цікаві варіанти з Codewars
function squareSum_(numbers) {
    return numbers.reduce((sum, num) => sum + (num * num), 0);
}
//
function squareSum__(numbers) {
    var result = 0;
    for (var i = 0; i < numbers.length; i++) {
        result += (numbers[i] * numbers[i]);
    }
    return result;
}
// ================================================================================================
// ================================================================================================
//**Task №8 Reversed Strings (8kyu)
/*
Доповніть рішення так, щоб воно перевернуло переданий у нього рядок.
*/

// Мій варіант
function solution(str) {
    return str.split('').reverse().join('');
}

// Цікаві варіанти з Codewars
const solution__ = s => [...s].reverse().join('');
//
function solution__(s) {
    var o = '';
    for (var i = s.length - 1; i >= 0; i--)
        o += s[i];
    return o;
}
// ================================================================================================
// ================================================================================================
//**Task №9 Remove First and Last Character (8kyu)
/*
Це досить просто. Ваша мета — створити функцію, яка видаляє перший і останній символи рядка.
Вам надається один параметр, вихідний рядок. Вам не потрібно турбуватися про рядки, які містять менше
двох символів.
'world'  =>  'orl'
*/

// Мій варіант
function removeChar(str) {
    let result = str.split('');
    result.pop();
    result.shift();
    return result.join('');
};

// Цікаві варіанти з Codewars
function removeChar_(str) {
    return str.slice(1, -1); // argument -1 is the same as 'str.length -1'
}
// ================================================================================================
// ================================================================================================