//*-Task №621 Sort arrays - 1  (7kyu)
/*
Просто використання сортування. Створіть функцію, яка повертає елементи вхідного масиву,
відсортовані в лексикографічному порядку.
*/

// Мій варіант
const sortme = function (names) {
  return names.sort();
};
// Цікаві варіанти з Codewars
const sortme_ = function (names) {
  return names.sort(function (a, b) {
    return a > b ? 1 : a < b ? -1 : 0;
  });
};
// ================================================================================================
// ================================================================================================
//*-залишилось 1758шт
// console.time('timer_1');
// console.timeEnd('timer_1');
