//*-Task №321 Count the number of cubes with paint on (8kyu)
/*
Прийшовши на співбесіду, вам пред’являють суцільний синій куб. Потім куб занурюють у червону фарбу,
покриваючи всю поверхню куба. Потім інтерв'юер продовжує розрізати куб у всіх трьох вимірах певну
кількість разів.
Ваша функція приймає як параметр кількість розрізів куба. Ви повинні повернути кількість менших кубиків,
утворених розрізами, які мають принаймні одну червону грань.
Щоб було зрозуміліше, на малюнку нижче показано куб після (зліва направо) 0, 1 і 2 розрізів.
Якщо ми розріжемо куб 2 рази, функція має повернути 26
Якщо ми розріжемо куб 4 рази, функція має повернути 98
*/

// Мій варіант
function countSquares (cuts) {
    if (cuts === 0) {
        return 1
    }
    let innerCube = Math.pow(cuts - 1, 3)
    let outerCube = Math.pow(cuts + 1, 3)
    return outerCube - innerCube
}
// Цікаві варіанти з Codewars
const countSquares_ = cuts => cuts === 0 ? 1 : (6 * cuts * cuts) + 2;
// ================================================================================================
// ================================================================================================
//*-Task №322 Take an Arrow to the knee, Functionally (8kyu)
/*
Вам буде надано масив чисел, які можна використовувати за допомогою методу String.fromCharCode() (JS),
для перетворення числа на символ. Рекомендується відобразити масив чисел і перетворити кожне число на
відповідний символ ASCII.

Приклади
Це приклад того, як перетворити число на символ ASCII:
Javascript => String.fromCharCode(97) // a
*/

// Мій варіант
const ArrowFunc = function (arr) {
    return String.fromCharCode(...arr);
}
// Цікаві варіанти з Codewars

// ================================================================================================
// ================================================================================================
//*-залишилось 60шт
// console.time('timer_1');
// console.timeEnd('timer_1');