//*-Task №801 Find all occurrences of an element in an array (7kyu)
/*
Дано масив цілих чисел та ціле число n.
Знайдіть усі входження n у заданий масив та поверніть інший масив,
що містить усі індексні позиції n у заданому масиві.

Якщо n немає у заданому масиві, поверніть порожній масив [].

Вважайте, що n та всі значення у заданому масиві завжди будуть цілими числами.

Приклад:
findAll([6, 9, 3, 4, 3, 82, 11], 3) => [2, 4]
*/

// Мій варіант
function findAll(array, n) {
  const result = [];
  array.forEach((number, i) => {
    if (number === n) {
      result.push(i);
    }
  });
  return result;
}
// Цікаві варіанти від GPT
const findAll_ = (arr, n) =>
  arr.map((v, i) => (v === n ? i : -1)).filter((i) => i !== -1);
// ================================================================================================
// ================================================================================================
// console.time('timer_1');
// console.timeEnd('timer_1');
