//*-Task №241 Is it a number? (8kyu)
/*
Дано рядок s, напишіть метод (функцію), який повертатиме true, якщо це дійсне єдине ціле чи
число з плаваючою речовиною, або false, якщо це не так.

Правильні приклади мають повертати true:
isDigit("3")
isDigit("  3  ")
isDigit("-3.23")

має повернути false:
isDigit("3-4")
isDigit("  3   5")
isDigit("3 5")
isDigit("zero")
*/

// Мій варіант
function isDigit(s) {
    return /^[\s]*[-+]?(\d+(\.\d*)?|\.\d+)([eE][-+]?\d+)?[\s]*$/.test(s);
}
// Цікаві варіанти з Codewars
function isDigit_(s) {
    return s == parseFloat(s);
}
//
function isDigit__(s) {
    return parseFloat(s) === Number(s)
}
// ================================================================================================
// ================================================================================================
//*-Task №242 ES6 string addition (8kyu)
/*
Легко з’єднати дві струни разом, як це string1 + string2.
Ще один спосіб отримати бажаний результат – string1.concat(string2)

ES6 представив інший спосіб об’єднання рядків. Ваше завдання — з’ясувати, що це таке,
і написати функцію, яка складатиме два рядки разом, між двома рядками має бути пробіл.

+ , .concat() і .join() не будуть дозволені в цій вправі.
Я також видалив деякі інші методи, які можна використовувати для обману!
Якщо один із аргументів є числом, ваш код має перетворити його на рядок.
*/

// Мій варіант
function joinStrings(string1, string2) {
    return `${string1.toString()} ${string2.toString()}`;
}
// Цікаві варіанти з Codewars
function joinStrings_(string1, string2) {
    return `${string1} ${string2}`
}
// ================================================================================================
// ================================================================================================
//*-Task №243 Chuck Norris VII - True or False? (Beginner) (8kyu)
/*
Загальновідомий факт, що Чак Норріс отримує все, що хоче. У результаті Чаку дуже рідко доводиться
вживати слово брехня.
Менш відомий факт, що якщо щось правда, а Чак цього не хоче, Чак може налякати правду своїми
величезними біцепсами, і вона автоматично стає фальшивою.

Ваше завдання - бути більше схожим на Чака (га! удачі!). Ви повинні повернути false, ніколи не
використовуючи слово false.
Покажи трохи правди, хто тут господар!
*/

// Мій варіант
function ifChuckSaysSo() {
    return !true;
}
// Цікаві варіанти з Codewars

// ================================================================================================
// ================================================================================================
//*-Task №244 Type of sum (8kyu)
/*
Повертає тип суми двох аргументів
*/

// Мій варіант
function typeOfSum(a, b) {
    return typeof (a + b);
}
// Цікаві варіанти з Codewars

// ================================================================================================
// ================================================================================================