//*-Task №721 Stanton measure (7kyu)
/*
Міра Стентона масиву обчислюється наступним чином:
Підрахуйте кількість входжень значення 1 у масив і нехай ця кількість дорівнює n.
Міра Стентона – це кількість разів, коли n з'являється в масиві.

Напишіть функцію, яка приймає цілочисельний масив і повертає його міру Стентона.

Приклади
Міра Стентона масиву [1, 4, 3, 2, 1, 2, 3, 2] дорівнює 3, оскільки 1 зустрічається в масиві 2 рази,
а 2 зустрічається 3 рази.

Міра Стентона масиву [1, 4, 1, 2, 11, 2, 3, 1] дорівнює 1, оскільки 1 зустрічається в масиві 3 рази,
а 3 зустрічається 1 раз.
*/

// Мій варіант
function stantonMeasure(a) {
  const n = a.reduce((sum, num) => {
    return num === 1 ? sum + num : sum;
  }, 0);
  const result = a.reduce((sum, num) => {
    return num === n ? sum + 1 : sum;
  }, 0);
  return result;
}
// Цікаві варіанти з Codewars
function stantonMeasure_(arr) {
  const count = (n) => arr.filter((x) => x === n).length;
  return count(count(1));
}
// ================================================================================================
// ================================================================================================
//*-Task №722 Create Phone Number (6kyu)
/*
Напишіть функцію, яка приймає масив із 10 цілих чисел (від 0 до 9) та повертає рядок цих чисел
у вигляді номера телефону.

Приклад
createPhoneNumber([1, 2, 3, 4, 5, 6, 7, 8, 9, 0]) // => повертає "(123) 456-7890"
Повернений формат має бути правильним для виконання цього завдання.

Не забудьте пробіли після закриваючих дужок!
*/

// Мій варіант
function createPhoneNumber(numbers) {
  return `${
    '(' +
    numbers[0] +
    numbers[1] +
    numbers[2] +
    ')' +
    ' ' +
    '' +
    numbers[3] +
    numbers[4] +
    numbers[5] +
    '-' +
    '' +
    numbers[6] +
    numbers[7] +
    numbers[8] +
    numbers[9]
  }`;
}
// Цікаві варіанти з Codewars
function createPhoneNumber_(numbers) {
  var format = '(xxx) xxx-xxxx';

  for (var i = 0; i < numbers.length; i++) {
    format = format.replace('x', numbers[i]);
  }

  return format;
}
//
function createPhoneNumber__(numbers) {
  numbers = numbers.join('');
  return (
    '(' +
    numbers.substring(0, 3) +
    ') ' +
    numbers.substring(3, 6) +
    '-' +
    numbers.substring(6)
  );
}
//
function createPhoneNumber___(numbers) {
  return numbers.reduce((p, c) => p.replace('x', c), '(xxx) xxx-xxxx');
}
//
function createPhoneNumber____(numbers) {
  return numbers.join('').replace(/(...)(...)(.*)/, '($1) $2-$3');
}
// ================================================================================================
// ================================================================================================
//*-Task №723 Duplicate Encoder (6kyu)
/*
Мета цієї вправи — перетворити рядок на новий рядок, де кожен символ у новому рядку буде
"(", якщо цей символ з'являється лише один раз у вихідному рядку, або ")", якщо цей символ
з'являється більше одного разу у вихідному рядку. Ігноруйте використання великих літер під час
визначення, чи є символ дублікатом.

Приклади
"din" => "((("
"recede" => "()()()"
"Success" => ")()())"
"(( @" => "))(("
Примітки
Повідомлення про твердження можуть бути незрозумілими щодо того, що вони відображають деякими мовами.
Якщо ви читаєте "...It Should encode XXX", "XXX" — це очікуваний результат, а не вхідні дані!
*/

// Мій варіант
function duplicateEncode(word) {
  const letters = word.split('');
  const result = letters.map((l) => {
    const escapedChar = l.replace(/[.*+?^${}()|[\]\\]/g, '\\$&');
    const reg = new RegExp(escapedChar, 'gi');
    return word.match(reg).length > 1 ? ')' : '(';
  });
  return result.join('');
}

// Цікаві варіанти з Codewars
function duplicateEncode_(word) {
  return word
    .toLowerCase()
    .split('')
    .map(function (a, _, w) {
      return w.indexOf(a) == w.lastIndexOf(a) ? '(' : ')';
    })
    .join('');
}
// ================================================================================================
// ================================================================================================
//*-Task №724 Bingo ( Or Not ) (6kyu)
/*
Для цієї гри в BINGO ви отримаєте на вхід один масив із 10 чисел від 1 до 26.
У масиві можливі дублікати чисел.

Кожне число відповідає літері алфавітного порядку (наприклад, 1 = A, 2 = B тощо).
Напишіть функцію, в якій ви виграєте гру, якщо ваші числа можуть написати 'BINGO'.
Вони не обов'язково повинні бути в правильному порядку у вхідному масиві.
В іншому випадку ви програєте. Ваші вихідні дані повинні бути 'WIN' або 'LOSE' відповідно.
*/

// Мій варіант
function bingo(a) {
  const bingoList = [2, 9, 14, 7, 15];
  for (let i = 0; i < bingoList.length; i++) {
    if (!a.includes(bingoList[i])) {
      return 'LOSE';
    }
  }
  return 'WIN';
}
// Цікаві варіанти з Codewars
const bingo_ = (ar) =>
  [2, 7, 9, 14, 15].every((e) => ar.includes(e)) ? 'WIN' : 'LOSE';
// ================================================================================================
// ================================================================================================
//*-залишилось 1660шт
// console.time('timer_1');
// console.timeEnd('timer_1');
