//*-Task №261 Pythagorean Triple (8kyu)
/*
Дано невідсортований масив із 3 натуральних чисел [ n1, n2, n3 ], визначте,
чи можна сформувати трійку Піфагора, використовуючи ці 3 цілі числа.

Трійка Піфагора складається з розташування 3 цілих чисел таким чином, що:

a2 + b2 = c2

Приклади
[5, 3, 4] : можна сформувати трійку Піфагора, використовуючи ці 3 цілі числа: 32 + 42 = 52
[3, 4, 5] : можна сформувати трійку Піфагора, використовуючи ці 3 цілі числа: 32 + 42 = 52
[13, 12, 5] : можна сформувати трійку Піфагора, використовуючи ці 3 цілі числа: 52 + 122 = 132
[100, 3, 999] : НЕможливо сформувати піфагорову трійку, використовуючи ці 3 цілих числа -
як би ви їх не розташували, ви ніколи не знайдете способу задовольнити рівняння a2 + b2 = c2

Повернуті значення
Для JavaScript: повертає true або false
*/

// Мій варіант
function isPythagoreanTriple(integers) {
    const arr = integers.sort((a, b) => a - b);
    return Math.pow(arr[0], 2) + Math.pow(arr[1], 2) === Math.pow(arr[2], 2);
}

// Цікаві варіанти з Codewars
function isPythagoreanTriple_(nums) {
    const [a, b, c] = nums.sort((a, b) => a - b)
    return a ** 2 + b ** 2 === c ** 2
}
// ================================================================================================
// ================================================================================================
//*-Task №262 Compare within margin (8kyu)
/*
Створіть функцію close_compare, яка приймає 3 параметри: a, b і необов’язкове поле.
Функція має повертати значення a менше, близько до або вище b.

Зверніть увагу на наступне:

Коли a близьке до b, поверніть 0.
Для цього завдання a вважається «близьким до» b, якщо маржа більша або дорівнює абсолютній відстані
між a і b.
Інакше...

Якщо a менше b, поверніть -1.
Якщо a більше b, повертається 1.
Якщо маржа не вказана, розглядайте її як нульову.
Припустимо: запас >= 0

Порада. У деяких мовах є спосіб зробити параметри необов’язковими.
Приклад 1
Якщо a = 3, b = 5 і margin = 3, то close_compare(a, b, margin) має повернути 0.
Це пояснюється тим, що a і b віддалені один від одного не більше ніж на 3 числа.

Приклад 2
Якщо a = 3, b = 5 і margin = 0, тоді close_compare(a, b, margin) має повернути -1.
Це тому, що відстань між a і b більша за 0, а a менша за b.
*/

// Мій варіант
function closeCompare(a, b, margin = 0) {
    if (Math.abs(a - b) <= margin) {
        return 0;
    } else if (a < b) {
        return -1;
    } else {
        return 1;
    }
}

// Цікаві варіанти з Codewars
function closeCompare_(a, b, m = 0) {
    return Math.abs(a - b) <= m ? 0 : Math.sign(a - b);
}
// ================================================================================================
// ================================================================================================
//*-залишилось 120шт
// console.time('timer_1');
// console.timeEnd('timer_1');