//*-Task №141 Grasshopper - Basic Function Fixer (8kyu)
/*
Виправте функцію
Я створив цю функцію, щоб додати п’ять до будь-якого переданого числа та повернути нове значення.
Він не видає жодних помилок, але повертає неправильне число.
*/

// Мій варіант
const addFive = num => num + 5;

// Цікаві варіанти з Codewars

// ================================================================================================
// ================================================================================================
//*-Task №142 Add Length (8kyu)
/*
Що, якщо нам потрібно додати довжину слів, розділених пробілом, у кінець того самого слова
та повернути це як масив?

"apple ban" --> ["apple 5", "ban 3"]
"you will win" -->["you 3", "will 4", "win 3"]
Ваше завдання — написати функцію, яка приймає рядок і повертає масив/список із довжиною кожного слова,
доданого до кожного елемента.

Примітка. Рядок матиме принаймні один елемент; слова завжди будуть розділені пробілом.
*/

// Мій варіант
const addLength = (str) => str.split(' ').map(word => `${word} ${word.length}`);

// Цікаві варіанти з Codewars

// ================================================================================================
// ================================================================================================
//*-залишилось 240шт