//*-Task №821 Simple fibonacci strings (7kyu)
/*
Враховуючи, що

f0 = '0'
f1 = '01'
f2 = '010' = f1 + f0
f3 = '01001' = f2 + f1
Вам буде задано число, і ваше завдання — повернути n-й рядок Фібоначчі. Наприклад:

solve(2) = '010'
solve(3) = '01001'
Більше прикладів у тестових випадках. Удачі!

Якщо вам подобаються послідовні ката, вам сподобається цей ката: Simple Prime Streaming
*/

// Мій варіант
function solve(n) {
  if (n === 0) return '0';
  if (n === 1) return '01';
  let a = '0'; // f0
  let b = '01'; // f1
  for (let i = 2; i <= n; i++) {
    const c = b + a; // fn = f(n-1) + f(n-2)
    a = b;
    b = c;
  }
  return b;
}
// Цікаві варіанти з Codewars
const solve_ = (n) =>
  n === 0 ? '0' : n === 1 ? '01' : solve(n - 1) + solve(n - 2);
// ================================================================================================
// ================================================================================================
// console.time('timer_1');
// console.timeEnd('timer_1');
