//*-Task №721 Stanton measure (7kyu)
/*
Міра Стентона масиву обчислюється наступним чином:
Підрахуйте кількість входжень значення 1 у масив і нехай ця кількість дорівнює n.
Міра Стентона – це кількість разів, коли n з'являється в масиві.

Напишіть функцію, яка приймає цілочисельний масив і повертає його міру Стентона.

Приклади
Міра Стентона масиву [1, 4, 3, 2, 1, 2, 3, 2] дорівнює 3, оскільки 1 зустрічається в масиві 2 рази,
а 2 зустрічається 3 рази.

Міра Стентона масиву [1, 4, 1, 2, 11, 2, 3, 1] дорівнює 1, оскільки 1 зустрічається в масиві 3 рази,
а 3 зустрічається 1 раз.
*/

// Мій варіант
function stantonMeasure(a) {
  const n = a.reduce((sum, num) => {
    return num === 1 ? sum + num : sum;
  }, 0);
  const result = a.reduce((sum, num) => {
    return num === n ? sum + 1 : sum;
  }, 0);
  return result;
}
// Цікаві варіанти з Codewars
function stantonMeasure_(arr) {
  const count = (n) => arr.filter((x) => x === n).length;
  return count(count(1));
}
// ================================================================================================
// ================================================================================================
//*-залишилось 1662шт
// console.time('timer_1');
// console.timeEnd('timer_1');
