//*-Task №101 Student's Final Grade (8kyu)
/*
Створити функцію finalGrade, яка розраховує підсумкову оцінку студента в залежності від двох параметрів:
оцінки за іспит і кількості виконаних робіт.

Ця функція повинна приймати два аргументи: exam - оцінка за іспит (від 0 до 100);
проекти - кількість виконаних проектів (від 0 і вище);

Ця функція має повертати число (кінцева оцінка). Є чотири види підсумкових оцінок:
100, якщо оцінка за іспит більше 90 або якщо кількість виконаних проектів більше 10.
90, якщо оцінка за іспит більше 75 і якщо кількість виконаних робіт не менше 5.
75, якщо оцінка за іспит більше 50 і якщо кількість виконаних робіт не менше 2.
0, в інших випадках
*/

// Мій варіант
function finalGrade(exam, projects) {
    if (exam > 90 || projects > 10) {
        return 100;
    } else if (exam > 75 && projects >= 5) {
        return 90;
    } else if (exam > 50 && projects >= 2) {
        return 75;
    } else {
        return 0;
    }
}

// Цікаві варіанти з Codewars
const finalGrade_ = (exam, projects) => {
    return (
        exam > 90 || projects > 10 ? 100 :
        exam > 75 && projects >= 5 ? 90 :
        exam > 50 && projects >= 2 ? 75 : 0
    )
}

// ================================================================================================
// ================================================================================================
//*-Task №102 Grasshopper - Messi goals function (8kyu)
/*
Функція голів Мессі
Мессі - футболіст з голами в трьох лігах:
LaLiga
Copa del Rey
Champions

Виконайте функцію, щоб повернути його загальну кількість голів у всіх трьох лігах.
Примітка: введені дані завжди будуть дійсними.
Наприклад:
5, 10, 2 --> 17
*/

// Мій варіант
function goals(laLigaGoals, copaDelReyGoals, championsLeagueGoals) {
    return laLigaGoals + copaDelReyGoals + championsLeagueGoals;
}

// Цікаві варіанти з Codewars
const goals_ = (...goalsArray) => goalsArray.reduce((a, b) => a + b);

// ================================================================================================
// ================================================================================================
//*-Task №103 I love you, a little , a lot, passionately ... not at all (8kyu)
/*
Хто пам’ятає часи на шкільному подвір’ї, коли дівчата брали квітку і рвали її пелюстки, промовляючи
кожну з наступних фраз кожного разу, коли пелюстка була зривана:

"I love you"
"a little"
"a lot"
"passionately"
"madly"
"not at all"
Якщо пелюсток більше 6, ви починаєте спочатку: «I love you» для 7 пелюсток, «a little» для 8 пелюсток
і так далі.

Коли була зірвана остання пелюстка, пролунали крики хвилювання, мрії, хвилювання думок і емоцій.
Ваша мета в цьому ката — визначити, яку фразу скажуть дівчата на останній пелюстці для квітки з заданою
кількістю пелюсток. Кількість пелюсток завжди більше 0.
*/

// Мій варіант
function howMuchILoveYou(nbPetals) {
    let petals = ["I love you", "a little", "a lot", "passionately", "madly", "not at all"];
    if(nbPetals <= petals.length) { return petals[nbPetals - 1]};
    if(nbPetals > petals.length && nbPetals % petals.length !== 0) { return petals[nbPetals % petals.length - 1]};
    if(nbPetals > petals.length && nbPetals % petals.length === 0) { return petals[petals.length - 1]};
}

// Цікаві варіанти з Codewars
const phrases = [
    'I love you',
    'a little',
    'a lot',
    'passionately',
    'madly',
    'not at all',
]

function howMuchILoveYou_(n) {
    return phrases[(n - 1) % phrases.length];
}

// ================================================================================================
// ================================================================================================
//*-Task №104 I love you, a little , a lot, passionately ... not at all (8kyu)
/*
Налагодження функції sayHello
Зоряний корабель «Ентерпрайз» зіткнувся з певною проблемою під час створення програми для вітання
всіх, хто підійде на борт. Ваше завдання — виправити код і повернути програму до роботи!

Приклад результату:
Hello, Mr. Spock
*/

// Мій варіант
function sayHello(name) {
    return `Hello, ${name}`;
}

// Цікаві варіанти з Codewars
function sayHello_(name) {
    return 'Hello, '.concat(name);
}
// ================================================================================================
// ================================================================================================
//*-залишилось 278шт