//*-Task №401 Categorize New Member (7kyu)
/*
Крокетний клуб Western Suburbs має дві категорії членства: старше та відкрите.
Їм потрібна ваша допомога з аплікаційною формою, у якій потенційним членам буде вказано, до якої
категорії вони будуть призначені.

Щоб бути старшим, член повинен бути не менше 55 років і мати гандикап більше 7.
У цьому крокетному клубі гандикап коливається від -2 до +26; чим кращий гравець, тим нижчий гандикап.

Введення
Вхідні дані складатимуться зі списку пар. Кожна пара містить інформацію про одного потенційного члена.
Інформація складається з цілого числа для віку людини та цілого числа для вади людини.

Вихід
Вихідні дані складатимуться зі списку рядкових значень (у Haskell і C: Open або Senior),
які вказуватимуть, чи буде відповідний член поміщений у старшу чи відкриту категорію.

Приклад
input =  [[18, 20], [45, 2], [61, 12], [37, 6], [21, 21], [78, 9]]
output = ["Open", "Open", "Senior", "Open", "Open", "Senior"]
*/

// Мій варіант
function openOrSenior(data) {
    return data.map(elem => elem[0] >= 55 && elem[1] > 7 ? 'Senior' : 'Open');
}
// Цікаві варіанти з Codewars
function openOrSenior_(data) {
    return data.map(([age, handicap]) => (age > 54 && handicap > 7) ? 'Senior' : 'Open');
}
// ================================================================================================
// ================================================================================================
//*-залишилось 1954шт
// console.time('timer_1');
// console.timeEnd('timer_1');