//*-Task №761 Least Larger (7kyu)
/*
Завдання
Дано масив чисел та індекс. Поверніть або індекс найменшого числа, яке більше за елемент із
заданим індексом, або -1, якщо такого індексу немає (або, де це можливо, Нічого чи аналогічне
порожнє значення).

Примітки
Можливо кілька правильних відповідей. У цьому випадку поверніть будь-яку з них.
Заданий індекс буде всередині заданого масиву.
Тому заданий масив ніколи не буде порожнім.

Приклад
leastLarger( [4, 1, 3, 5, 6], 0 )  =>  3
leastLarger( [4, 1, 3, 5, 6], 4 )  => -1
 */

// Мій варіант
function leastLarger(a, i) {
  const targetValue = a[i];

  return a.reduce((result, current, index) => {
    if (current > targetValue && (result === -1 || current < a[result])) {
      return index;
    }
    return result;
  }, -1);
}
// Цікаві варіанти з Codewars
const leastLarger_ = (a, i) =>
  a.indexOf(Math.min(...a.filter((n) => n > a[i])));
// ================================================================================================
// ================================================================================================
// console.time('timer_1');
// console.timeEnd('timer_1');
