"use strict"
// ================================================================================================
//*-Task №41 MakeUpperCase (8kyu)
/*
Напишіть функцію, яка перетворює вхідний рядок у верхній регістр.
*/

// Мій варіант
const makeUpperCase = (str) => (str.toUpperCase());

// Цікаві варіанти з Codewars
function makeUpperCase_(str) {
    return str.replace(/[a-z]/g, s => String.fromCharCode(s.charCodeAt(0) - 32))
}
// ================================================================================================
// ================================================================================================
//*-Task №42 Reversed sequence (8kyu)
/*
Створіть функцію, яка повертає масив цілих чисел від n до 1, де n>0.
Приклад: n=5 --> [5,4,3,2,1]
*/

// Мій варіант
const reverseSeq = n => {
    let arr = [];
    for (let i = 1; i <= n; i++) {
        arr.unshift(i);
    }
    return arr;
};

// Цікаві варіанти з Codewars
const reverseSeq_ = n => {
    return Array.from({ length: n }, (_, i) => n - i);
};
// ================================================================================================
// ================================================================================================