//*-Task №121 Well of Ideas - Easy Version (8kyu)
/*
На кожну хорошу ідею ката, здається, є чимало поганих!

У цьому ката вам потрібно перевірити наданий масив (x) на наявність хороших ідей як 'good' і поганих
ідей як 'bad'. Якщо є одна чи дві хороші ідеї, поверніть 'Publish!', якщо їх більше 2, поверніть
'I smell a series!'. Якщо хороших ідей немає, як це часто буває, поверніть 'Fail!.
*/

// Мій варіант
function well(x) {
    let good = x.filter(elem => elem === 'good');
    return good.length > 2 ? 'I smell a series!' : good.length === 0 ? 'Fail!' : 'Publish!';
}
// Цікаві варіанти з Codewars

// ================================================================================================
// ================================================================================================
//*-Task №122 Vowel remover (8kyu)
/*
Створіть функцію під назвою shortcut для видалення голосних малих літер (a, e, i, o, u) у заданому рядку.

Приклади
"hello"     -->  "hll"
"codewars"  -->  "cdwrs"
"goodbye"   -->  "gdby"
"HELLO"     -->  "HELLO"
не турбуйтеся про великі голосні
y не вважається голосним для цієї ката
*/

// Мій варіант
function shortcut(string) {
    return string.split('a').join('').split('e').join('').split('i').join('').split('o').join('').split('u').join('');
}

// Цікаві варіанти з Codewars
function shortcut_(string) {
    return string.replace(/[aeiou]/g, '')
}
//
function shortcut__(s) {
    return s
        .replaceAll('e', '')
        .replaceAll('o', '')
        .replaceAll('a', '')
        .replaceAll('i', '')
        .replaceAll('u', '')
}
// ================================================================================================
// ================================================================================================
//*-Task №123 Training JS #1: create your first JS function and print "Hello World!" (8kyu)
/*
Перегляньте два приклади вище та напишіть свою першу функцію JS.
*/

// Мій варіант
function helloWorld() {
    let str = 'Hello World!';
    console.log(str);
}

// Цікаві варіанти з Codewars

//

// ================================================================================================
// ================================================================================================
//*-Task №124 Short Long Short (8kyu)
/*
Дано 2 рядки, a і b, повернути рядок у формі короткий+довгий+короткий, з коротшим рядком назовні
та довшим усередині. Рядки не будуть однакової довжини, але вони можуть бути порожніми (нульова довжина).

Довжина рядка не завжди збігається з кількістю символів

("1", "22") --> "1221"
("22", "1") --> "1221"
*/

// Мій варіант
function solution(a, b) {
    return a.length > b.length ? b + a + b : a + b + a;
}
//
const solution_ = (a, b) => {
    return a.length > b.length ? `${b}${a}${b}` : `${a}${b}${a}`
}

// Цікаві варіанти з Codewars

// ================================================================================================
// ================================================================================================
//*-залишилось 258шт