//*-Task №441 Factorial (7kyu)
/*
У математиці факторіал цілого невід’ємного числа n, що позначається n!, є добутком усіх натуральних
чисел, менших або рівних n. Наприклад: 5! = 5 * 4 * 3 * 2 * 1 = 120. За домовленістю значення 0! дорівнює 1.

Напишіть функцію для обчислення факторіалу для заданого вхідного параметра.
Якщо вхідні дані нижче 0 або вище 12, викидайте виняток типу ArgumentOutOfRangeException (C#) або
IllegalArgumentException (Java) чи RangeException (PHP) або викидайте RangeError (JavaScript)
чи ValueError (Python) або повертайте -1 (C).
*/

// Мій варіант
function factorial(n) {
    if (n < 0 || n > 12) {
        throw new RangeError("Input should be between 0 and 12 inclusive.");
    }
    let factorial = 1;
    for (let i = 1; i <= n; i++) {
        factorial *= i;
    }
    return factorial;
}

// Цікаві варіанти з Codewars
function factorial_(n) {
    if (n < 0 || n > 12)
        throw new RangeError();
    return n <= 1 ? 1 : n * factorial(n - 1);
}
// ================================================================================================
// ================================================================================================
//*-Task №442 Check the exam (7kyu)
/*
Перший вхідний масив є ключем до правильних відповідей на іспиті, наприклад ["a", "a", "b", "d"].
Другий містить надіслані студентом відповіді.

Два масиви не порожні та мають однакову довжину. Поверніть оцінку для цього масиву відповідей,
даючи +4 для кожної правильної відповіді, -1 для кожної неправильної відповіді та +0 для кожної пустої
відповіді, представленої у вигляді порожнього рядка (у C використовується символ пробілу).

Якщо оцінка < 0, поверніть 0.

Наприклад:
    Correct answer    |    Student's answer   |   Result         
 ---------------------|-----------------------|-----------
 ["a", "a", "b", "b"]   ["a", "c", "b", "d"]  →     6
 ["a", "a", "c", "b"]   ["a", "a", "b", "" ]  →     7
 ["a", "a", "b", "c"]   ["a", "a", "b", "c"]  →     16
 ["b", "c", "b", "a"]   ["" , "a", "a", "c"]  →     0
*/

// Мій варіант
function checkExam(array1, array2) {
    let score = 0;
    for (let i = 0; i < array1.length; i++) {
        if (array1[i] === array2[i]) {
            score += 4;
        }
        if (array1[i] !== array2[i] && array2[i] !== '') {
            score -= 1;
        }
    }
    return score > 0 ? score : 0;
}

// Цікаві варіанти з Codewars
const checkExam_ = (x, y) => (x = y.reduce((s, e, i) => s + (e === x[i] ? 4 : e === '' ? 0 : -1), 0)) > 0 ? x : 0;
// ================================================================================================
// ================================================================================================
//*-залишилось 1921шт
// console.time('timer_1');
// console.timeEnd('timer_1');