//*-Task №421 Don't give me five! (7kyu)
/*
Не дай мені п'ять!
У цій ката ви отримуєте початковий і кінцевий номер регіону, а також повинні повертати кількість
усіх чисел, крім чисел із 5. Початкове та кінцеве число включено!

Приклади:
1,9 -> 1,2,3,4,6,7,8,9 -> Result 8
4,17 -> 4,6,7,8,9,10,11,12,13,14,16,17 -> Result 12

Результат може містити п'ятірки. ;-)
Початкове число завжди буде меншим за кінцеве. Обидва числа можуть бути також негативними!
Мені дуже цікаві ваші рішення та те, як ви це вирішуєте.
Можливо, хтось із вас знайде легке чисто математичне рішення.

Насолоджуйтесь кодуванням і, будь ласка, не забудьте проголосувати та оцінити це ката! :-)
Я також створив інші ката. Подивіться, якщо вам сподобалася ця ката!
*/

// Мій варіант
function dontGiveMeFive(start, end) {
    const numbers = [];
    for (let i = start; i <= end; i++) {
        numbers.push(i);
    }
    return numbers.filter(number => {
        if (number.toString().includes('5')) {
            return false;
        }
        return true;
    }).length;
}

// Цікаві варіанти з Codewars
function dontGiveMeFive_(start, end) {
    let count = 0
    for (let i = start; i <= end; i++) {
        if (!/5/.test(i)) {
            count++
        }
    }
    return count
}
// ================================================================================================
// ================================================================================================
//*-Task №422 Sort array by string length (7kyu)
/*
Напишіть функцію, яка приймає масив рядків як аргумент і повертає відсортований масив, що містить ті
самі рядки, упорядковані від найкоротшого до найдовшого.

Наприклад, якщо цей масив передано як аргумент:
["Telescopes", "Glasses", "Eyes", "Monocles"]

Ваша функція поверне такий масив:
["Eyes", "Glasses", "Monocles", "Telescopes"]

Усі рядки в масиві, переданому вашій функції, будуть різної довжини, тому вам не доведеться вирішувати,
як упорядкувати кілька рядків однакової довжини.
*/

// Мій варіант
function sortByLength(array) {
    return array.sort((a, b) => {
        return a.length - b.length;
    });
}
// Цікаві варіанти з Codewars

// ================================================================================================
// ================================================================================================
//*-Task №423 Breaking chocolate problem (7kyu)
/*
Ваше завдання — розрізати плитку шоколаду заданих розмірів n x m на маленькі квадратики.
Кожен квадрат має розмір 1x1 і не розбивається. Реалізуйте функцію, яка повертатиме мінімальну
кількість необхідних розривів.

Наприклад, якщо вам дали плитку шоколаду розміром 2 х 1, ви можете розділити її на окремі квадрати
лише за один розрив, але для розміру 3 х 1 ви повинні зробити дві перерви.

Якщо вхідні дані недійсні, ви маєте повернути 0 (якщо перерви не потрібні, якщо у нас немає шоколаду
для розділення). Введення завжди буде невід’ємним цілим числом.
*/

// Мій варіант
function breakChocolate(n, m) {
    if (n <= 0 || m <= 0) { return 0 };
    return (n - 1) * m + (m - 1);
}
// Цікаві варіанти з Codewars
var breakChocolate_ = function (n, m) {
    return (n * m === 0) ? 0 : n * m - 1;
};
//
var breakChocolate__ = function (n, m) {
    return Math.max(0, m * n - 1);
};
// ================================================================================================
// ================================================================================================
//*-Task №424 Money, Money, Money (7kyu)
/*
Містер Скрудж має суму грошей «P», яку він хоче інвестувати. Перш ніж це зробити, він хоче знати,
скільки років «Y» цю суму «P» потрібно зберігати в банку, щоб вона склала бажану суму грошей «D».

Сума зберігається протягом «Y» років у банку, де щорічно виплачуються відсотки «I». Після сплати
податків «T» за рік нова сума реінвестується.

Примітка щодо податків: оподатковується не інвестована основна сума, а лише нараховані проценти за рік

Приклад:
Нехай P буде основним = 1000,00
Нехай I — процентна ставка = 0,05
Нехай T буде податковою ставкою = 0,18
Нехай D буде бажаною сумою = 1100,00

Після 1-го курсу --> P = 1041,00
Після 2 курсу --> P = 1083,86
Після 3 курсу --> P = 1128,30

Таким чином, містеру Скруджу доводиться чекати 3 роки, поки початкова сума не досягне бажаної суми.

Ваше завдання полягає в тому, щоб виконати запропонований метод і повернути кількість років «Y» в цілому,
щоб містер Скрудж отримав бажану суму.

Припущення: припустимо, що бажаний принципал «D» завжди більший за початковий принципал.
Однак найкраще взяти до уваги, що якщо бажаний принципал «D» дорівнює принципалу «P», це має повернути 0 років.
*/

// Мій варіант
function calculateYears(principal, interest, tax, desired) {
    let years = 0;
    let P = principal;

    while (P < desired) {
        let I = P * interest;
        let T = tax * I;
        let bonus = I - T;
        years++;
        P += bonus;
    }
    return years;
}
// Цікаві варіанти з Codewars
function calculateYears_(principal, interest, tax, desired) {
    var years = 0;
    while (principal < desired) {
        principal += (principal * interest) * (1 - tax);
        years++;
    }
    return years;
}
// ================================================================================================
// ================================================================================================
//*-залишилось 1937шт
// console.time('timer_1');
// console.timeEnd('timer_1');