//*-Task №561 The Office I - Outed (7kyu)
/*
Ваші колеги дивилися вам через плече. Коли ви повинні були виконувати свою справжню нудну роботу,
ви використовували робочі комп’ютери, щоб розгромити нескінченні години кодових воєн.

На зборах команди жахлива, жахлива людина заявляє групі, що ви не працюєте. Ви в біді.
Ви повинні швидко оцінити відчуття в кімнаті, щоб вирішити, чи варто вам збирати свої речі та йти.

Враховуючи об’єкт ( зустріч ), ​​який містить імена членів команди як ключі та їх рейтинг щастя з 10
як значення, вам потрібно оцінити загальний рейтинг щастя групи. Якщо <= 5, поверніть «Get Out Now!».
Інакше поверніть «Nice Work Champ!».

Рейтинг щастя буде загальним балом / кількістю людей у ​​кімнаті.

Зверніть увагу, що ваш бос у кімнаті ( бос ). Їхня оцінка вдвічі перевищує номінал (але вони все одно
одна людина!).
*/

// Мій варіант
function outed(meet, boss) {
    // Сума усіх рейтингів
    let totalHappiness = 0;
    // Кількість людей у кімнаті
    let numberOfPeople = 0;

    for (let person in meet) {
        if (person === boss) {
            // Рейтинг боса рахується вдвічі
            totalHappiness += meet[person] * 2;
        } else {
            totalHappiness += meet[person];
        }
        numberOfPeople++;
    }

    // Обчислення середнього рейтингу щастя
    const averageHappiness = totalHappiness / numberOfPeople;

    // Повернення результату на основі середнього рейтингу
    return averageHappiness <= 5 ? 'Get Out Now!' : 'Nice Work Champ!';
}

// Цікаві варіанти з Codewars
function outed_(meet, boss) {
    let names = Object.keys(meet);
    let score = names.reduce((s, v) => s + meet[v], 0) + meet[boss];
    return score / names.length > 5 ? 'Nice Work Champ!' : 'Get Out Now!';
}
// ================================================================================================
// ================================================================================================
//*-Task №562 Nth Smallest Element (Array Series #4) (7kyu)
/*
Вступ і розминка (настійно рекомендовано): Гра зі масивами

Дано масив цілих чисел, знайдіть N-й найменший елемент у масиві.

Примітки
Розмір масиву становить принаймні 3.
Числа масиву можуть бути сумішшю позитивних, негативних і нулів.
Може виникнути повторення чисел масиву, тому не видаляйте дублікати.
Вхід >> Вихід Приклади
arr=[3,1,2]            n=2    ==> return 2 
arr=[15,20,7,10,4,3]   n=3    ==> return 7 
arr=[2,169,13,-5,0,-1] n=4    ==> return 2 
arr=[2,1,3,3,1,2],     n=3    ==> return 2 
*/

// Мій варіант
function nthSmallest(arr, pos) {
    return arr.sort((a, b) => a - b)[pos - 1];
}
// Цікаві варіанти з Codewars

// ================================================================================================
// ================================================================================================
//*-Task №563 Currying functions: multiply all elements in an array (7kyu)
/*
Щоб завершити цю Kata, вам потрібно створити функцію multiplyAll, яка приймає масив цілих чисел як
аргумент. Ця функція має повертати іншу функцію, яка приймає одне ціле число як аргумент і повертає
новий масив.

Повернений масив має складатися з кожного елемента першого масиву, помноженого на ціле число.

приклад:
multiplyAll([1, 2, 3])(2) = [2, 4, 6];
Не можна змінювати вихідний масив.
*/

// Мій варіант
function multiplyAll(arr) {
    return function (num) {
        return arr.map((element) => element * num);
    };
}
// Цікаві варіанти з Codewars
const multiplyAll_ = (a) => (x) => a.map((e) => e * x);
// ================================================================================================
// ================================================================================================
//*-залишилось 1811шт
// console.time('timer_1');
// console.timeEnd('timer_1');
