//*-Task №741 Formatting decimal places #1 (7kyu)
/*
Кожне число з плаваючою комою має бути відформатовано таким чином, щоб поверталися лише перші два
знаки після коми. Вам не потрібно перевіряти, чи введене число є коректним, оскільки в тестах
використовуються лише коректні числа.

Не округляйте числа! Просто відріжте їх після двох знаків після коми!
Правильні приклади:
32,8493 – це 32,84
14,3286 – це 14,32

Неправильні приклади (наприклад, якщо округлити числа):
32,8493 – це 32,85
14,3286 – це 14,33
*/

// Мій варіант
function twoDecimalPlaces(num) {
  return parseInt(num * 100) / 100;
}
// Цікаві варіанти з Codewars
const twoDecimalPlaces = (number) => Math.trunc(number * 100) / 100;
// ================================================================================================
// ================================================================================================
//*-Task №742 Reverse the bits in an integer (7kyu)
/*
Напишіть функцію, яка перевертає біти в цілому числі.
Наприклад, число 417 у двійковій системі буде 110100001. Перетворення двійкової системи на
інвертовані буде 100001011, що дорівнює 267.
Можна вважати, що число не є від'ємним.
*/

// Мій варіант
function reverseBits(n) {
  const reversN = n.toString(2).split('').reverse().join('');
  return parseInt(reversN, 2);
}
// Цікаві варіанти з Codewars

// ================================================================================================
// ================================================================================================
// console.time('timer_1');
// console.timeEnd('timer_1');
