//*-Task №241 Is it a number? (8kyu)
/*
Дано рядок s, напишіть метод (функцію), який повертатиме true, якщо це дійсне єдине ціле чи
число з плаваючою речовиною, або false, якщо це не так.

Правильні приклади мають повертати true:
isDigit("3")
isDigit("  3  ")
isDigit("-3.23")

має повернути false:
isDigit("3-4")
isDigit("  3   5")
isDigit("3 5")
isDigit("zero")
*/

// Мій варіант
function isDigit(s) {
    return /^[\s]*[-+]?(\d+(\.\d*)?|\.\d+)([eE][-+]?\d+)?[\s]*$/.test(s);
}
// Цікаві варіанти з Codewars
function isDigit_(s) {
    return s == parseFloat(s);
}
//
function isDigit__(s) {
    return parseFloat(s) === Number(s)
}
// ================================================================================================
// ================================================================================================
//*-Task №242 ES6 string addition (8kyu)
/*
Легко з’єднати дві струни разом, як це string1 + string2.
Ще один спосіб отримати бажаний результат – string1.concat(string2)

ES6 представив інший спосіб об’єднання рядків. Ваше завдання — з’ясувати, що це таке,
і написати функцію, яка складатиме два рядки разом, між двома рядками має бути пробіл.

+ , .concat() і .join() не будуть дозволені в цій вправі.
Я також видалив деякі інші методи, які можна використовувати для обману!
Якщо один із аргументів є числом, ваш код має перетворити його на рядок.
*/

// Мій варіант
function joinStrings(string1, string2) {
    return `${string1.toString()} ${string2.toString()}`;
}
// Цікаві варіанти з Codewars
function joinStrings_(string1, string2) {
    return `${string1} ${string2}`
}
// ================================================================================================
// ================================================================================================
//*-Task №243 Chuck Norris VII - True or False? (Beginner) (8kyu)
/*
Загальновідомий факт, що Чак Норріс отримує все, що хоче. У результаті Чаку дуже рідко доводиться
вживати слово брехня.
Менш відомий факт, що якщо щось правда, а Чак цього не хоче, Чак може налякати правду своїми
величезними біцепсами, і вона автоматично стає фальшивою.

Ваше завдання - бути більше схожим на Чака (га! удачі!). Ви повинні повернути false, ніколи не
використовуючи слово false.
Покажи трохи правди, хто тут господар!
*/

// Мій варіант
function ifChuckSaysSo() {
    return !true;
}
// Цікаві варіанти з Codewars

// ================================================================================================
// ================================================================================================
//*-Task №244 Type of sum (8kyu)
/*
Повертає тип суми двох аргументів
*/

// Мій варіант
function typeOfSum(a, b) {
    return typeof (a + b);
}
// Цікаві варіанти з Codewars

// ================================================================================================
// ================================================================================================
//*-Task №245 Enumerable Magic #1 - True for All? (8kyu)
/*
Створіть метод, який приймає два параметри:

- послідовність
- функція (вказівник на функцію в C)
і повертає true, якщо функція в параметрах повертає true для кожного елемента в послідовності.
В іншому випадку він повинен повернути false.
Якщо послідовність порожня, вона має повернути true, оскільки технічно нічого не пройшло перевірку.
all((1, 2, 3, 4, 5), greater_than_9) -> false
all((1, 2, 3, 4, 5), less_than_9)    -> True
*/

// Мій варіант
function all(arr, fun) {
    return arr.every(fun);
}
// Цікаві варіанти з Codewars

// ================================================================================================
// ================================================================================================
//*-Task №246 Thinkful - Number Drills: Blue and red marbles (8kyu)
/*
Ви з другом вирішили пограти в гру, щоб розвинути свою статистичну інтуїцію. Гра працює так:

У вас є купа червоних і синіх кульок. Щоб розпочати гру, ви берете жменю кульок кожного кольору та
кладете їх у мішок, відстежуючи, скільки кульок кожного кольору входить. Ви по черзі простягаєте руку
в мішок, вгадуєте колір, а потім витягуєте одну кульку. Ви отримуєте бал, якщо вгадали правильно.
Хитрість у тому, що у вас є лише три секунди, щоб зробити припущення, тому вам доведеться швидко думати.

Ви вирішили написати функцію guessBlue(), яка допоможе автоматично обчислити,
чи слід вгадати «синій» чи «червоний». Функція повинна приймати чотири аргументи:

кількість синіх кульок, які ви поклали в мішок для початку
кількість червоних кульок, які ви поклали в мішок для початку
кількість блакитних кульок, витягнутих на даний момент (завжди менше початкової кількості синіх кульок)
кількість червоних кульок, витягнутих на даний момент (завжди менше початкової кількості червоних кульок)
guessBlue() має повертати ймовірність малювання блакитної кульки,
виражену у вигляді числа з плаваючою точкою.
Наприклад, guessBlue(5, 5, 2, 3) має повернути 0,6.
*/

// Мій варіант
function guessBlue(blueStart, redStart, bluePulled, redPulled) {
    const blue = blueStart - bluePulled;
    const red = redStart - redPulled;
    return blue / (red + blue);
}

// Цікаві варіанти з Codewars

// ================================================================================================
// ================================================================================================
//*-Task №247 Return to Sanity (8kyu)
/*
Ця функція має повертати об’єкт, але вона не виконує те, що задумано. Що не так?
*/

// Мій варіант
function mystery() {
    var results = { sanity: 'Hello' };
    return results;
}

// Цікаві варіанти з Codewars

// ================================================================================================
// ================================================================================================
//*-Task №248 For UFC Fans (Total Beginners): Conor McGregor vs George Saint Pierre (8kyu)
/*
Це ката для початківців, особливо для шанувальників UFC/MMA.

Це бій між двома легендами: Конор Макгрегор проти Джорджа Сен-П’єра в Медісон Сквер Гарден.
Лише один боєць залишиться стояти, а після бою в інтерв'ю Джо Рогану переможець зробить свою
легендарну заяву. Ваше завдання – повернути правильне твердження залежно від переможця!

Якщо переможцем стане Джордж Сен-П’єр, він, очевидно, скаже:
"I am not impressed by your performance.".

Якщо переможцем стане Конор МакГрегор, він, безсумнівно, скаже:
"I'd like to take this chance to apologize.. To absolutely NOBODY!"

Примітка
Ім’я може відрізнятися за регістром, наприклад, це може бути «George Saint Pierre» або
«geOrGe saiNT pieRRE». Ваше рішення має розглядати обидва як одне й те саме (незалежно від регістру).
*/

// Мій варіант
var quote = function (fighter) {
    const winner = fighter.toLowerCase();
    switch (winner) {
        case 'conor mcgregor':
            return "I'd like to take this chance to apologize.. To absolutely NOBODY!";

        case 'george saint pierre':
            return "I am not impressed by your performance.";
    }
};

// Цікаві варіанти з Codewars
var quote_ = function (fighter) {
    switch (fighter.toLowerCase()) {
        case 'conor mcgregor': return "I'd like to take this chance to apologize.. To absolutely NOBODY!";
        case 'george saint pierre': return "I am not impressed by your performance.";
        default: 'Who are you?'
    }
};
// ================================================================================================
// ================================================================================================