//*-Task №701 (7kyu)
/*
У вашому класі ви розпочали уроки арифметичної прогресії. Оскільки ви також програміст,
ви вирішили написати функцію, яка повертатиме перші n елементів послідовності із заданою
спільною різницею d та першим елементом a. Зверніть увагу, що різниця може дорівнювати нулю!

Результатом має бути рядок чисел, розділених комою та пробілом.

Приклад
# first element: 1, difference: 2, how many: 5
arithmetic_sequence_elements(1, 2, 5) == "1, 3, 5, 7, 9"
*/

// Мій варіант
function arithmeticSequenceElements(a, d, n) {
  let result = [];
  for (let i = 0; i < n; i++) {
    result.push(a + i * d);
  }
  return result.join(', ');
}
// Цікаві варіанти з Codewars
function arithmeticSequenceElements_(a, r, n) {
  var ret = [a];
  while (--n) ret.push((a += r));
  return ret.join(', ');
}
// ================================================================================================
// ================================================================================================
//*-залишилось 1678шт
// console.time('timer_1');
// console.timeEnd('timer_1');
