//*-Task №101 Student's Final Grade (8kyu)
/*
Створити функцію finalGrade, яка розраховує підсумкову оцінку студента в залежності від двох параметрів:
оцінки за іспит і кількості виконаних робіт.

Ця функція повинна приймати два аргументи: exam - оцінка за іспит (від 0 до 100);
проекти - кількість виконаних проектів (від 0 і вище);

Ця функція має повертати число (кінцева оцінка). Є чотири види підсумкових оцінок:
100, якщо оцінка за іспит більше 90 або якщо кількість виконаних проектів більше 10.
90, якщо оцінка за іспит більше 75 і якщо кількість виконаних робіт не менше 5.
75, якщо оцінка за іспит більше 50 і якщо кількість виконаних робіт не менше 2.
0, в інших випадках
*/

// Мій варіант
function finalGrade(exam, projects) {
    if (exam > 90 || projects > 10) {
        return 100;
    } else if (exam > 75 && projects >= 5) {
        return 90;
    } else if (exam > 50 && projects >= 2) {
        return 75;
    } else {
        return 0;
    }
}

// Цікаві варіанти з Codewars
const finalGrade_ = (exam, projects) => {
    return (
        exam > 90 || projects > 10 ? 100 :
        exam > 75 && projects >= 5 ? 90 :
        exam > 50 && projects >= 2 ? 75 : 0
    )
}

// ================================================================================================
// ================================================================================================
//*-Task №102 Grasshopper - Messi goals function (8kyu)
/*
Функція голів Мессі
Мессі - футболіст з голами в трьох лігах:
LaLiga
Copa del Rey
Champions

Виконайте функцію, щоб повернути його загальну кількість голів у всіх трьох лігах.
Примітка: введені дані завжди будуть дійсними.
Наприклад:
5, 10, 2 --> 17
*/

// Мій варіант
function goals(laLigaGoals, copaDelReyGoals, championsLeagueGoals) {
    return laLigaGoals + copaDelReyGoals + championsLeagueGoals;
}

// Цікаві варіанти з Codewars
const goals_ = (...goalsArray) => goalsArray.reduce((a, b) => a + b);

// ================================================================================================
// ================================================================================================
//*-залишилось 280шт