//*-Task №141 Grasshopper - Basic Function Fixer (8kyu)
/*
Виправте функцію
Я створив цю функцію, щоб додати п’ять до будь-якого переданого числа та повернути нове значення.
Він не видає жодних помилок, але повертає неправильне число.
*/

// Мій варіант
const addFive = num => num + 5;

// Цікаві варіанти з Codewars

// ================================================================================================
// ================================================================================================
//*-Task №142 Add Length (8kyu)
/*
Що, якщо нам потрібно додати довжину слів, розділених пробілом, у кінець того самого слова
та повернути це як масив?

"apple ban" --> ["apple 5", "ban 3"]
"you will win" -->["you 3", "will 4", "win 3"]
Ваше завдання — написати функцію, яка приймає рядок і повертає масив/список із довжиною кожного слова,
доданого до кожного елемента.

Примітка. Рядок матиме принаймні один елемент; слова завжди будуть розділені пробілом.
*/

// Мій варіант
const addLength = (str) => str.split(' ').map(word => `${word} ${word.length}`);

// Цікаві варіанти з Codewars

// ================================================================================================
// ================================================================================================
//*-Task №143 Triple Trouble (8kyu)
/*
Потрійна біда
Створіть функцію, яка повертатиме рядок, який об’єднує всі літери трьох введених рядків у групи.
Взяти першу літеру всіх вхідних даних і згрупувати їх один біля одного. Зробіть це для кожної літери,
дивіться приклад нижче!

наприклад Вхід: "aa", "bb" , "cc" => Вихід: "abcabc"
Примітка. Можна очікувати, що всі вхідні дані будуть однакової довжини.
*/

// Мій варіант
function tripleTrouble(one, two, three) {
    let result = '';
    for(let i = 0; i < one.length; i++) {
        result += one[i] + two[i] + three[i];
    }
    return result;
}

// Цікаві варіанти з Codewars
function tripleTrouble_(one, two, three) {
    var result = "";
    for (let i = 0; i < one.length; i++) {
        result += one.charAt(i) + two.charAt(i) + three.charAt(i);
    }
    return result;
}
//
const tripleTrouble__ = (one, two, three) => one.split("").map((letter, index) => letter + two[index] + three[index]).join("");
//
function tripleTrouble___(one, two, three) {
    return one.replace(/./g, (v, i) => v + two[i] + three[i])
}
// ================================================================================================
// ================================================================================================
//*-Task №144 Bin to Decimal (8kyu)
/*
Виконайте функцію, яка перетворює двійкове число (у вигляді рядка) у десяткове число.
'10' -> 2
'1001001' -> 73
1024, 512, 256, 128, 64, 32, 16, 8, 4, 2, 1
*/

// Мій варіант
const bin = '1001001';
function binToDec(bin) {
    let binaryCodeArray = [1];
    let binaryCodeElem = 1;
    let binToArray = bin.split('').reverse();
    let result = 0;
    for(let i = 1; i < bin.length; i++) {
        binaryCodeElem *=  2;
        binaryCodeArray.push(binaryCodeElem);
    }
    for(let i = 0; i < bin.length; i++) {
        if(binToArray[i] === '1') {
            result += binaryCodeArray[i];
        }
    }
    return result;
}

// Цікаві варіанти з Codewars\
function binToDec_(bin) {
    return parseInt(bin, 2);
}
/*
parseInt(string, radix) - це вбудований метод JS, який використовується для перетворення рядка в ціле число
у відповідності з вказанною системою обчислення (radix).
У контексті перетворення двійкових чисел, радікс зазвичай встановлюють 2.

string: Рядок, який потрібно перетворити в число.
radix: Опціональний параметр, вказує на основну систему обчислення. Це ціле число від 2 до 36.
Якщо він не вказаний, JS автоматично обере його в залежності від рядка.
*/
//
const binToDec__ = bin => [...bin].reduce((dec, bit) => dec << 1 | bit, 0);

// ================================================================================================
// ================================================================================================
//*-Task №145 Plural (8kyu)
/*
Нам потрібна проста функція, яка визначає, чи потрібна множина чи ні. Він має приймати число та
повертати true, якщо з цим числом потрібно використовувати множину, або false, якщо ні.
Це буде корисно під час друку рядка, наприклад 5 хвилин, 14 яблук або 1 сонце.

Вам потрібно лише потурбуватися про правила англійської граматики для цієї ката, де все, що не є
одниною (одним із чогось), є множиною (не одним із чогось).

Усі значення будуть додатними цілими чи числами з плаваючою речовиною або нулем.
*/

// Мій варіант
function plural(n) {
    return n !== 1;
}

// Цікаві варіанти з Codewars\


// ================================================================================================
// ================================================================================================
//*-Task №146 Generate range of integers (8kyu)
/*
Реалізуйте функцію generateRange, яка приймає три аргументи (початок, зупинка, крок) і повертає
діапазон цілих чисел від початку до кінця (включно) з кроком кроку.

Приклади
(1, 10, 1) -> [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
(-10, 1, 1) -> [-10, -9, -8, -7, -6, -5, -4, -3, -2, -1, 0, 1]
(1, 15, 20) -> [1]
Примітка
почати < зупинити
крок > 0
*/

// Мій варіант
function generateRange(min, max, step){
    let result = [];
    for (let i = min; i <= max; i += step) {
        result.push(i);
    }
    return result;
}

// Цікаві варіанти з Codewars\
function generateRange_(min, max, step) {
    return min > max ? [] : [min, ...generateRange(min + step, max, step)];
}

// ================================================================================================
// ================================================================================================
//*-Task №147 Exclamation marks series #11: Replace all vowel to exclamation mark in the sentence (8kyu)
/*
Замініть у реченні всі голосні на знак оклику. aeiouAEIOU — голосна.

Приклади
replace("Hi!") === "H!!"
replace("!Hi! Hi!") === "!H!! H!!"
replace("aeiou") === "!!!!!"
replace("ABCDE") === "!BCD!"
*/

// Мій варіант
function replace(s) {
    return s.replace(/[aeiou]/gi, '!');
}

// Цікаві варіанти з Codewars

// ================================================================================================
// ================================================================================================
//*-Task №148 Hex to Decimal (8kyu)
/*
Виконайте функцію, яка перетворює шістнадцяткове число (у вигляді рядка) у десяткове число.
*/

// Мій варіант
function hexToDec(hexString) {
    return parseInt(hexString, 16);
}

// Цікаві варіанти з Codewars

// ================================================================================================
// ================================================================================================
//*-залишилось 234шт