"use strict"
// ================================================================================================
/*
Написати функцію яка отримує два агрументи array, target.
array - масив чисел,
target - число.
В нас є дві операції "+" та "-"
Потрібно розставити ці операції між числами в масиві так щоб отримати число target
Варіанти відповіді:
1. Повертаємо true якщю це можливо або false якщо ні.
2. Повертаємо масив з разставленними операціями.
*/
// let nums = [3, 7, 4, 2, 5];
// let target = 9;
// function hitsTheTarget(array, target) {
    
// }

function f(str, regex) {
    let reg = new RegExp(`${regex}`);
    return reg.test(str);
}
console.log(f('test', 'i'));
